Repository: 84000/data-translation-memory
Catalog: toh235-v3.tmx
Source language: bo
Languages: en

source: ཀུན་དུ་མངོན་པར་ཕྱོགས་པའི་ནོར་བུའི་རྒྱལ་པོ་སྣང་བར་བྱེད་པའི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རྒྱན་བཀོད་པ་ཐམས་ཅད་ཀྱིས་རབ་ཏུ་བརྒྱན་པའི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་འོད་འཕྲོ་བའི་སྒྲོན་མའི་ཕྲེང་བའི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། ཀུན་ནས་སྒྲ་རིན་པོ་ཆེའི་ཤིང་ལྗོན་པ་འབྱུང་བའི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སྤོས་དང་མེ་ཏོག་དང་། པད་མ་ཐམས་ཅད་ཀྱི་ཕྲེང་བ་རིན་པོ་ཆེའི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གདན་བཀོད་པ་ཀུན་དུ་སྟོན་པའི་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོའི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། བཀོད་པ་ཐམས་ཅད་ཀྱི་ཕྲེང་བ་རབ་ཏུ་དཔྱངས་པའི་རྟ་བབས་སྟེགས་བུས་རབ་ཏུ་བརྒྱན་པ་རིན་པོ་ཆེའི་སྤྲིན་གྱི་སྙིང་པོ་ཅན་གྱི་
en: We will fill the sky with emanations of oceans of clouds of lion thrones containing infinite jewel-colored lotus flowers; oceans of clouds of lion thrones containing the brilliant, multifaceted kings of jewels; oceans of clouds of lion thrones containing adornments of all manner of ornamentation; oceans of clouds of lion thrones containing garlands of lamps that radiate the brilliant light of various jewels; oceans of clouds of lion thrones containing the source of a universally resounding rainfall of jewels; oceans of clouds of lion thrones containing precious garlands of all manner of incense, flowers, and lotus flowers; oceans of clouds of lion thrones containing the kings of jewels that completely manifest the adornments of the seats of all buddhas; oceans of clouds of lion thrones containing clouds of jewels and completely adorned with railed arches draped with garlands of all manner of adornments; oceans of clouds of lion thrones containing trees with precious jeweled branches and stores of incense powders; and oceans of clouds of lion thrones containing adornments of nets festooned with various incenses and jeweled bells as bright as the sun.

source: སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། ནོར་བུ་རིན་པོ་ཆེའི་ཡལ་ག་དང་། ཕྱེ་མའི་མཛོད་ཡོད་པའི་སྡོང་པོ་ཐམས་ཅད་ཀྱི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སྤོས་སྣ་ཚོགས་དང་རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་ཀུན་ནས་རྒྱན་ཉི་མ་སྣང་བར་བྱེད་པའི་སྙིང་པོ་ཅན་གྱི་སེང་གེའི་ཁྲི་རྒྱ་མཚོ་སྤྲིན་རྣམས་ཀྱིས་ནམ་མཁའི་དཀྱིལ་ཀུན་དུ་ཁེབས་པར་བྱིན་གྱིས་བརླབས་ཏེ། སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་བསྟི་སྟང་དུ་བྱའོ།
en: With these, we will pay homage to all the oceans of buddhas and bodhisattvas.

source: །བླ་མར་བྱའོ། །རི་མོར་བྱའོ། །མཆོད་པར་བྱའོ། །ཡིད་བཞིན་གྱི་
en: We will exalt them, honor them, and make offerings to them. “

source: ནོར་བུའི་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་གཞལ་མེད་ཁང་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། ཨན་ད་རྙིལ་གྱི་ཟེ་བ་ཅན་གྱི་མེ་ཏོག་བཀོད་པ་ཐམས་ཅད་ཀྱི་བླ་རེ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སྤོས་དང་། ནོར་བུ་ཐམས་ཅད་ཀྱི་བླ་རེ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེའི་འོད་འཕྲོ་བའི་སྒྲོན་མའི་གཟུགས་ཀྱི་བླ་རེ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སངས་རྒྱས་ཀྱི་རྫུ་འཕྲུལ་རྣམ་པར་སྟོན་པར་སྣང་བའི་དབྱངས་ཅན་གྱི་ནོར་བུའི་རྒྱལ་པོའི་བླ་རེ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། ནོར་བུ་སྣ་ཚོགས་ཀྱི་གོས་བཀོད་པ་ཐམས་ཅད་སྣང་བ་ཀུན་ཏུ་སྟོན་པའི་བླ་རེ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། མེ་ཏོག་ཐམས་ཅད་ཀྱི་ཆུ་བོ་འབར་བར་སྣང་བའི་རིན་པོ་ཆེའི་བླ་རེ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། དྲིལ་བུ་
en: We will fill the sky with emanations of oceans of clouds of immeasurable palaces formed from all manner of wish-fulfilling kings of jewels; oceans of clouds of canopies adorned with all manner of flowers with indranīla anthers; oceans of clouds of canopies with all manner of incenses and gemstones; oceans of clouds of canopies formed like lamps radiating jewel light; oceans of clouds of canopies of kings of jewels resounding with melodies appearing from the Buddha’s magical display; oceans of clouds of canopies that display the appearance of being completely adorned with bejeweled cloth; oceans of clouds of canopies of precious jewels that shine with a blazing flood of flowers; oceans of clouds of canopies of nets of sundry bells that fill everywhere with their sounds; oceans of clouds of canopies of nets of lotus flowers having the essence of gemstones, resplendent with the brightness of infinite variegated blazing lotus flowers; oceans of clouds of canopies of victory banners that shine with the brilliant light rays of golden anthers; and oceans of clouds of canopies bedecked with an inconceivable amount of brilliant, radiant adornments.

source: སྣ་ཚོགས་ཀྱི་སྒྲས་ཀུན་དུ་རྒྱས་པར་འགེངས་པའི་དྲ་བའི་བླ་རེ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། པད་མ་འབར་བ་ཁ་དོག་མཐའ་ཡས་པ་སྣ་ཚོགས་སུ་སྣང་བའི་ནོར་བུའི་སྙིང་པོ་ཅན་གྱི་པད་མའི་དྲ་བའི་བླ་རེ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། གསེར་གྱི་ཟེ་བ་ཅན་གྱི་འོད་ཟེར་སྣང་བའི་རྒྱལ་མཚན་གྱི་བླ་རེ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། བཀོད་པ་བསམ་གྱིས་མི་ཁྱབ་པར་སྣང་བའི་འོད་མཐའ་ཡས་པ་བཀོད་པ་ཐམས་ཅད་ཀྱི་རྒྱན་གྱི་བླ་རེ་རྒྱ་མཚོ་སྤྲིན་རྣམས་ཀྱིས་ནམ་མཁའི་དཀྱིལ་ཀུན་དུ་ཁེབས་པར་བྱིན་གྱིས་བརླབས་ཏེ། སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་གང་ཆེན་མཚོ་སྤྲིན་རྒྱ་མཚོ་ཐམས་ཅད་ལ་བསྟི་སྟང་དུ་བྱའོ།
en: With these, we will pay homage to all the vast oceans of buddhas and bodhisattvas.

source: །ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཐམས་ཅད་ཀྱི་གདུགས་རྒྱ་མཚོ་སྤྲིན་རྣམས་ཀྱིས་ནམ་མཁའི་དཀྱིལ་ཀུན་དུ་ཁེབས་པར་བྱིན་གྱིས་བརླབས་ལ་རིན་པོ་ཆེ་བཅུའི་འོད་ཟེར་སྣང་བ་བཀོད་པའི་མེ་ཏོག་གི་གདུགས་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། མུ་ཏིག་ཁ་དོག་མཐའ་ཡས་པའི་མཛོད་ཀྱི་གདུགས་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྙིང་རྗེའི་སྒོའི་སྒྲའི་ནོར་བུའི་རྒྱལ་པོའི་གདུགས་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་འོད་འཕྲོ་བའི་ཕྲེང་བའི་གདུགས་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེའི་རྡུལ་ཀུན་དུ་སྣང་བས་རབ་ཏུ་བརྒྱན་པའི་དྲིལ་བུའི་དྲ་བ་དཔྱངས་པའི་གདུགས་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། ནོར་བུ་ཐམས་ཅད་ཀྱི་སྡོང་པོའི་ཡལ་གའི་རྒྱན་ཅན་གྱི་གདུགས་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། ཉི་མ་རྣམ་པར་སྣང་བར་བྱེད་པའི་འོད་འཕྲོ་བའི་ནོར་བུའི་རྒྱལ་པོ་དང་།
en: We will fill the sky with emanations of oceans of parasols with all manner of various precious jewels; oceans of clouds of parasols of flowers adorned with the ten precious jewels, which radiate brilliant light; oceans of clouds of parasols containing stores of pearls in an infinite variety of colors; oceans of clouds of parasols of the kings of jewels that resound with the teachings on compassion of all the buddhas and bodhisattvas; oceans of clouds of parasols with radiant garlands of various jewels; oceans of clouds of parasols hung with nets of bells completely decorated with brilliant jewel dust; oceans of clouds of parasols adorned with tree branches made from all manner of gemstones; oceans of clouds of parasols with the radiant kings of jewels that shine profusely like the sun and with all manner of incenses and perfumes; oceans of clouds of parasols imbued with stores of sandalwood powder spreading everywhere; and oceans of clouds of parasols imbued with all manner of adornments, filling everywhere and illuminating the vast, great domain of the buddhas.

source: སྤོས་དང་། བདུག་པ་ཐམས་ཅད་ཀྱི་གདུགས་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། ཙན་དན་གྱི་ཕྱེ་མའི་མཛོད་ཀུན་དུ་རྒྱས་པར་འགེངས་པའི་གདུགས་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཡུལ་རྒྱ་ཆེན་པོ་སྣང་བར་བྱེད་པ་ཀུན་དུ་བཀོད་པས་རྒྱས་པར་འགེངས་པའི་གདུགས་རྒྱ་མཚོ་སྤྲིན་མ་འདྲེས་པ་རྣམས་ཀྱིས་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་བསྟི་སྟང་དུ་བྱའོ།
en: With these, we will pay homage to all the oceans of buddhas and bodhisattvas.

source: །བླ་མར་བྱའོ། །རི་མོར་བྱའོ། །མཆོད་པར་བྱའོ། །རིན་པོ་ཆེ་ཐམས་ཅད་སྣང་བའི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་འོད་འཕྲོ་བ་ཐམས་ཅད་ཀྱི་གཟུགས་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་སྤྲིན་མ་འདྲེས་པ་རྣམས་དང་། མེ་ཏོག་གི་སྤྲིན་སྣང་བར་བྱེད་པའི་འོད་ཀྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་འོད་ཟེར་སངས་རྒྱས་ཀྱི་སྤྲུལ་པའི་འོད་ཀྱི་དཀྱིལ་འཁོར་དང་ལྡན་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་སྣང་བར་གཏོགས་པའི་འོད་ཀྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། ཀུན་ནས་སྒོ་སངས་རྒྱས་ཀྱི་ཡུལ་སྒྲོགས་པ་རིན་པོ་ཆེའི་ཡལ་གའི་འོད་ཀྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། བཻ་དཱུརྱ་དང་།
en: We will exalt them, honor them, and make offerings to them. “

source: རིན་པོ་ཆེའི་རིགས་དང་། ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཐམས་ཅད་ཀྱི་འོད་ཟེར་གྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སེམས་ཅན་གྱི་གཟུགས་མཐའ་ཡས་པ་དག་སེམས་ཀྱི་སྐད་ཅིག་ལ་ཀུན་དུ་སྟོན་པའི་འོད་ཀྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་ལས་བྱུང་བ་ཡིད་དུ་འོང་བའི་སྒྲ་རབ་ཏུ་འབྱིན་པ་དང་ལྡན་པའི་འོད་ཀྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དུ་སེམས་ཅན་འདུལ་བའི་དབྱངས་ཅན་ནོར་བུའི་རྒྱལ་པོའི་འོད་ཀྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་སྤྲིན་རྣམས་ཀྱིས་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་བསྟི་སྟང་དུ་བྱའོ།
en: We will fill the sky with oceans of clouds of multitudes of the splendor of all jewels; distinct oceans of clouds of multitudes of the light of the forms of all radiant jewels; oceans of clouds of multitudes of the light that illuminates clouds of flowers; oceans of clouds of light rays of all jewels endowed with multitudes of light emanated by the Buddha; oceans of clouds of multitudes of light that pervades all buddhafields with light; oceans of clouds of multitudes of the light of jeweled branches that resound in the buddha realms in all directions; oceans of clouds of multitudes of the light of the light rays of beryl, precious substances, and all the kings of precious jewels; oceans of clouds of multitudes of light that, in a single instant of thought, fully display the infinite forms of sentient beings; oceans of clouds of multitudes of light endowed with pleasing emitted sounds arisen from the aspirations of all the buddhas; and oceans of clouds of multitudes of the light of the kings of jewels that possess the melodies that tame sentient beings in all assemblies—with these, we will pay homage to all the oceans of buddhas and bodhisattvas.

source: །བླ་མར་བྱའོ། །རི་མོར་བྱའོ། །མཆོད་པར་བྱའོ། །ནོར་བུ་ཐམས་ཅད་ཀྱི་མཛོད་ཀྱི་འོད་ཟེར་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་བྱའི་འོད་ཟེར་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་འོད་འཕྲོ་བ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་སྒྲོགས་པ་རྒྱས་པར་འགེངས་པའི་འོད་ཟེར་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་།
en: We will exalt them, honor them, and make offerings to them. “

source: སངས་རྒྱས་ཀྱི་ཞིང་བཀོད་པ་ཐམས་ཅད་སྣང་བར་བྱེད་པའི་འོད་ཟེར་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། མེ་ཏོག་གི་ཁང་པ་བརྩེགས་པ་ཐམས་ཅད་ཀྱི་འོད་ཟེར་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རྡུལ་གྱི་འོད་ཟེར་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། བསྐལ་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཐམས་ཅད་དུ་སངས་རྒྱས་འབྱུང་བས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་སྒྲོགས་པ་ཅན་གྱི་འོད་ཟེར་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་མི་ཟད་པ་ཐམས་ཅད་བསྟན་པ་དང་། མེ་ཏོག་ཐམས་ཅད་ཀྱི་ཟེ་བའི་འོད་ཟེར་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་།
en: We will fill the sky with emanations of oceans of clouds of the light rays of stores of all gemstones; oceans of clouds of light rays of the forms, voices, scents, tastes, and sensations of all the buddhas; oceans of clouds of the radiant light of all precious jewels; oceans of clouds of light rays that fill everywhere with the sounds of the Dharma of all the buddhas; oceans of clouds of light rays that illuminate the entire array of buddhafields; oceans of clouds of the light rays of all multistoried palaces of flowers; oceans of clouds of the light rays of the particles of all jewels; oceans of clouds of light rays possessing the roar of the entire succession of buddhas arising within a single eon, which brings sentient beings to maturation; displays of inexhaustible jewels; oceans of clouds of light rays of the anthers of all flowers; and distinct oceans of clouds of light rays emitted from the array of all thrones.

source: ཁྲི་སྟན་བཀོད་པ་ཐམས་ཅད་ཀུན་ཏུ་སྟོན་པའི་འོད་ཟེར་རྒྱ་མཚོ་སྤྲིན་མ་འདྲེས་པ་རྣམས་ཀྱིས་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་བསྟི་སྟང་དུ་བྱའོ།
en: With these we will pay homage to all the oceans of buddhas and bodhisattvas.

source: །བླ་མར་བྱའོ། །རི་མོར་བྱའོ། །མཆོད་པར་བྱའོ། །རིན་པོ་ཆེའི་འོད་འཕྲོ་བ་ཁ་དོག་མཐའ་ཡས་པ་རྒྱ་མཚོ་སྤྲིན་མ་འདྲེས་པ་རྣམས་དང་། ཀུན་ཏུ་འོད་ཀྱི་ནོར་བུའི་རྒྱལ་པོ་འོད་འཕྲོ་བ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཞིང་རྒྱ་ཆེན་པོ་བཀོད་པ་སྣང་བར་བྱེད་པའི་འོད་འཕྲོ་བ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། སྤོས་ཐམས་ཅད་ཀྱི་འོད་འཕྲོ་བ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། བཀོད་པ་ཐམས་ཅད་ཀྱི་འོད་འཕྲོ་བ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་།
en: We will exalt them, honor them, and make offerings to them. “

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྤྲུལ་པའི་འོད་འཕྲོ་བ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཤིང་གི་ཟེ་བ་འོད་འཕྲོ་བ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། གོས་ཐམས་ཅད་ཀྱི་འོད་འཕྲོ་བ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་མཐའ་ཡས་པའི་སྤྱོད་པ་དབྱངས་ཅན་ནོར་བུའི་རྒྱལ་པོའི་འོད་འཕྲོ་བ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། མུ་ཏིག་གི་སྒྲོན་མ་ཐམས་ཅད་ཀྱི་འོད་འཕྲོ་བ་རྒྱ་མཚོ་སྤྲིན་མ་འདྲེས་པ་རྣམས་ཀྱིས་སངས་རྒྱས་དང་།
en: We will fill the sky with emanations of distinct oceans of clouds of the infinitely colored radiant light of precious jewels; oceans of clouds of the radiant light of all-illuminating kings of jewels; oceans of clouds of radiant light that illuminates the great, vast array of all buddhafields; oceans of clouds of the radiant light of all manner of incenses; oceans of clouds of the radiant light of all manner of adornments; oceans of clouds of the radiant light of the emanations of all buddhas; oceans of clouds of the radiant light of the anthers of trees of various jewels; and oceans of clouds of the radiant light of all manner of clothes.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ཆེན་མཚོའི་སྤྲིན་གྱི་རྒྱ་མཚོ་ཐམས་ཅད་ལ་བསྟི་སྟང་དུ་བྱའོ།
en: With these we will pay homage to all the vast oceans of buddhas and bodhisattvas.

source: །སྤོས་དང་མེ་ཏོག་སྣ་ཚོགས་ཐམས་ཅད་ཀྱི་རྒྱན་རྒྱ་མཚོ་སྤྲིན་བསམ་གྱིས་མི་ཁྱབ་པ་རྣམས་དང་། རིན་པོ་ཆེ་འོད་འཕྲོ་བ་ཐམས་ཅད་ཀྱི་པད་མའི་དྲ་བ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཁ་དོག་མཐའ་ཡས་པའི་འོད་ཀྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཁ་དོག་དང་ལྡན་པའི་མུ་ཏིག་གི་མཛོད་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་དང་། སྤོས་དང་། ཙན་དན་ཐམས་ཅད་ཀྱི་ཕྱེ་མ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་གདུགས་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། ནོར་བུའི་རྒྱལ་པོ་ཡིད་དུ་འོང་ཞིང་སྡུག་པ་མཛེས་པའི་དབྱངས་ཅན་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། ཉི་མའི་འོད་ཀྱི་ནོར་བུའི་ཚོགས་ཀྱི་ཕྲེང་བ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་།
en: We will fill the sky with emanations of inconceivable oceans of clouds of the adornments of all manner of various incenses and flowers; oceans of clouds of lotus nets of all manner of radiant jewels; oceans of clouds of stores of pearls endowed with the colors of all manner of jewels; oceans of clouds of powders made from all manner of jewels, incenses, and sandalwoods; oceans of clouds of parasols with all manner of jewels; oceans of clouds possessing pleasing kings of jewels and beautifying melodies; oceans of clouds of garlands with hosts of gemstones possessing the brilliance of the sun; oceans of clouds of infinite stores of jewels; and oceans of clouds of distinct bodies that are perfect in every way.

source: རིན་པོ་ཆེའི་མཛོད་མཐའ་ཡས་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་དང་། ཐམས་ཅད་ཀུན་ཏུ་བཟང་པོའི་ལུས་མ་འདྲེས་པ་རྒྱ་མཚོ་སྤྲིན་རྣམས་ཀྱིས་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་གང་ཆེན་མཚོའི་སྤྲིན་གྱི་རྒྱ་མཚོ་ཐམས་ཅད་ལ་བསྟི་སྟང་དུ་བྱའོ།
en: With these, we will pay homage to all the vast oceans of buddhas and bodhisattvas.

source: །ཞེས་དེ་ལྟ་བུའི་སྨོན་ལམ་བཏབ་ནས་ཀླུའི་རྒྱལ་པོ་དེ་དག་གིས་ཡང་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ་ཞབས་ལ་ཕྱག་འཚལ་བ་དང་།
en: With such words, they made this aspiration. At this point, all the nāga kings circumambulated the Bhagavān three times and prostrated, touching his feet.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གནང་ནས་རང་རང་གི་སྟན་ལ་འཁོད་དོ།
en: With the Bhagavān’s permission, they each took their seats.

source: །དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོ་ཀླུའི་བདག་པོ་ཆེན་པོ་ཕྱིར་མི་ལྡོག་པའི་སྨོན་ལམ་གྱི་སྟོབས་ཅན་གཡོག་མཐའ་ཡས་རྒྱ་མཚོའི་སྤྲིན་བཀོད་པའི་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་གདུགས་ལྟ་བུའི་རྒྱལ་པོ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བ་དང་། ཆོས་མཉན་པའི་ཕྱིར་འཛམ་བུའི་གླིང་འདིར་འོངས་སོ།
en: At that time, possessing the strength of irreversible aspiration, the great lord of the nāgas in the trichiliocosm called Ananta­parikara­sāgara­megha­vyūha­tejo­maṇḍala­chartākāra­rāja came to this Jambudvīpa continent in order to listen to the Dharma and make offerings, pay homage, and venerate the Tathāgata.

source: །དེ་ནས་ཀླུའི་བདག་པོ་གཡོག་མཐའ་ཡས་རྒྱ་མཚོའི་སྤྲིན་བཀོད་པའི་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་གདུགས་ལྟ་བུའི་རྒྱལ་པོ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །གལ་ཏེ་ཞུས་ན་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུའོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Then, the nāga lord Ananta­parikara­sāgara­megha­vyūha­tejo­maṇḍala­chartākāra­rāja arose from his seat, draped his robe over one shoulder, touched his right knee to the ground with joined palms, and addressed the Bhagavān, asking, “If the Bhagavān might find time to grant an explanation in response to my inquiry, I would ask a question of the bhagavān, tathāgata, arhat, complete and perfect Buddha.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་བདག་པོ་གཡོག་མཐའ་ཡས་རྒྱ་མཚོའི་སྤྲིན་བཀོད་པའི་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་གདུགས་ལྟ་བུའི་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཀླུའི་བདག་པོ་ཅི་དང་། ཅི་འདོད་པ་དྲིས་ཤིག་དང་། ངས་དྲིས་པ་དེ་དང་དེའི་ལུང་བསྟན་པས་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: The Bhagavān replied to Ananta­parikara­sāgara­megha­vyūha­tejo­maṇḍala­chartākāra­rāja, “Nāga lord, ask whatever you wish, and I will give you an explanation that will delight your mind.”

source: བཅོམ་ལྡན་འདས་ལ་ཀླུའི་བདག་པོ་གཡོག་མཐའ་ཡས་རྒྱ་མཚོའི་སྤྲིན་བཀོད་པའི་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་གདུགས་ལྟ་བུའི་རྒྱལ་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ཀླུ་ཐམས་ཅད་ཀྱི་ཀླུའི་སྡུག་བསྔལ་ཐམས་ཅད་རྒྱུན་ཆད་པར་འགྱུར།
en: The nāga lord Ananta­parikara­sāgara­megha­vyūha­tejo­maṇḍala­chartākāra­rāja asked the Bhagavān, “Bhagavān, how can all the suffering specific to nāgas be eliminated?

source: བདེ་བ་ཐམས་ཅད་དང་ལྡན་པ་དང་རབ་ཏུ་དགའ་བར་འགྱུར།
en: How can they become happy and joyful?

source: འཛམ་བུའི་གླིང་འདིར་དུས་དུས་སུ་ཆར་གྱི་རྒྱུན་འབེབ་པར་འགྱུར།
en: How can abundant rains be sent here to the continent of Jambudvīpa, time after time?

source: རྩྭ་དང་། ཤིང་གེལ་བ་དང་། སྨན་དང་། ནགས་ཚལ་ཐམས་ཅད་འཁྲུང་བར་འགྱུར།
en: How can all manner of grasses, trees, medicinal herbs, and forests to come to arise?

source: འབྲུ་ཐམས་ཅད་སྐྱེ་བར་འགྱུར།
en: How can all grains come to grow?

source: བཅུད་ཐམས་ཅད་ཡང་དག་པར་སྐྱེ་བར་འགྱུར།
en: How can all beings to come grow?

source: གང་གིས་འཛམ་བུའི་གླིང་གི་མི་རྣམས་བདེ་བ་དང་ལྡན་པར་འགྱུར། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: How can all people here in the continent of Jambudvīpa attain happiness?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀླུའི་བདག་པོ་གཡོག་མཐའ་ཡས་རྒྱ་མཚོའི་སྤྲིན་བཀོད་པའི་གཟི་བརྗིད་ཀྱི་དཀྱིལ་འཁོར་གདུགས་ལྟ་བུའི་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Bhagavān replied to the nāga lord Ananta­parikara­sāgara­megha­vyūha­tejo­maṇḍala­chartākāra­rāja, “Nāga lord, excellent.

source: །ཀླུའི་བདག་པོ་ཁྱོད་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བའི་ཕྱིར་ཞུགས་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་ཡོངས་སུ་འདྲི་བར་སེམས་པ་ལེགས་སོ།
en: It is excellent that you have thought to ask this question of the Tathāgata, in order to benefit all sentient beings and establish them in happiness.

source: །ལེགས་སོ། །ཀླུའི་བདག་པོ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། ངས་ཁྱོད་ལ་བཤད་དོ།
en: Nāga lord, I will explain this to you—listen well and bear my words in mind.

source: །ཀླུའི་བདག་པོ་ཆོས་གཅིག་དང་ལྡན་ན། ཀླུ་ཐམས་ཅད་ཀྱི་ཀླུའི་སྡུག་བསྔལ་ཐམས་ཅད་རྒྱུན་ཆད་པར་འགྱུར་བདེ་བ་དང་ལྡན་པར་འགྱུར་རོ།
en: Nāga lord, if you possess this unique Dharma teaching, all the suffering specific to nāgas of all the nāgas will be eliminated, and they will become joyful.

source: །ཆོས་གཅིག་པོ་གང་ཞེ་ན།
en: What is that unique Dharma teaching?

source: འདི་ལྟ་སྟེ། བྱམས་པའོ།
en: It is loving-kindness.

source: །ཀླུའི་བདག་པོ་བྱམས་པ་དེ་ལ་གནས་པའི་ལྷ་དང་། མི་རྣམས་ནི་མེས་མི་ཚིག །
en: Nāga lord, gods and humans who abide in that loving-kindness will not be harmed by fire.

source: མཚོན་གྱིས་མི་ཚུགས།
en: They will not be harmed by weapons.

source: ཆུས་མི་ཁྱེར།
en: They will not be swept away by water.

source: དུག་གིས་མི་ཚུགས།
en: They will not be harmed by poison.

source: ཕ་རོལ་གྱི་དམག་ཚོགས་ཀྱིས་ཟིལ་གྱིས་མི་ནོན།
en: They will not be overcome by enemy troops.

source: བདེ་བར་གཉིད་ཀྱིས་ལོག་པར་འགྱུར། བདེ་བར་སད་པར་འགྱུར།
en: They will sleep happily and wake happily.

source: རང་གི་བསོད་ནམས་ཀྱིས་ཡོངས་སུ་བསྲུང་བར་འགྱུར། བསོད་ནམས་ཆེན་པོའི་གཟི་བརྗིད་ཀྱིས་གཟི་ཅན་དུ་འགྱུར།
en: They will always be protected by their own merit and become brilliant with the splendor of great merit.

source: ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་མི་བརྫི་བར་འགྱུར།
en: They will be unconquerable by the world with its gods.

source: མཛེས་པ་དང་མཐོང་ན་དགའ་བར་འགྱུར།
en: They will become beautiful and pleasing to behold.

source: འགྲོ་བ་ཐམས་ཅད་དུ་ཐགས་ཐོགས་མེད་པར་འགྱུར།
en: They will be unobstructed on all paths.

source: སྡུག་བསྔལ་ཐམས་ཅད་རྒྱུན་ཆད་པ་དང་རབ་ཏུ་དགའ་བར་འགྱུར།
en: They will cut off all suffering and become utterly joyful.

source: བདེ་བ་ཐམས་ཅད་དང་ལྡན་པ་དང་། མིའི་ཆོས་བླ་མ་རྟོགས་ནས། ལུས་ཞིག་པའི་འོག་ཏུ་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: Having gained all manner of happiness and realized the most unexcelled Dharma among humans, they will take birth in the Brahmā world after their body passes away. “

source: ཀླུའི་བདག་པོ་ལྷ་དང་མིའི་བྱམས་པ་ལ་གནས་པ་རྣམས་ཀྱི་ཕན་ཡོན་ནི་འདི་དག་གོ།
en: Nāga lord, these are the benefits for gods and humans who abide in loving-kindness.

source: །ཀླུའི་བདག་པོ་དེ་བས་ན་བྱམས་པའི་ལུས་ཀྱི་ལས་དང་། བྱམས་པའི་ངག་གི་ལས་དང་། བྱམས་པའི་ཡིད་ཀྱི་ལས་ཀྱིས་གནས་པར་བྱའོ།
en: Therefore, Nāga lord, you should abide with your body, speech, and mind engaged in actions of loving-kindness.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་བདེ་བ་ཐམས་ཅད་སྦྱིན་པ་ཞེས་བྱ་བའི་གཟུངས་བརྗོད་པར་བྱ་སྟེ། དེས་ཀླུ་ཐམས་ཅད་ཀྱི་ཀླུའི་སྡུག་བསྔལ་ཐམས་ཅད་རྒྱུན་གཅོད་པར་བྱེད། བདེ་བ་ཐམས་ཅད་སྦྱིན་པར་བྱེད་དེ། འཛམ་བུའི་གླིང་འདིར་དུས་དུས་སུ་ཆར་གྱི་རྒྱུན་འབེབས་པར་བྱེད།
en: Nāga lord, moreover, you should proclaim the dhāraṇī known as bestowing all happiness.

source: རྩྭ་དང་། ཤིང་གེལ་པ་དང་། སྨན་དང་། ནགས་ཚལ་དང་། ལོ་ཐོག་ཐམས་ཅད་སྐྱེ་བར་བྱེད་དོ།
en: This dhāraṇī will eliminate all the suffering specific to nāgas of all the nāgas, bestow all happiness, send abundant rains again and again here to the continent of Jambudvīpa, and cause all grasses, trees, medicinal herbs, forests, and crops to grow.

source: །ཀླུའི་བདག་པོ་དེ་ལ་བདེ་བ་ཐམས་ཅད་སྦྱིན་པ་ཞེས་བྱ་བའི་གཟུངས་དེ་གང་ཞེ་ན། ཏདྱ་ཐཱ། ངྷཱ་ར་ཎི་དྷཱ་ར་ཎི། ཨུདྡྷཱ་ར་ཎི། སམ་པྲ་ཏིཥྛི་ཏེ། བི་ཛ་ཡ་བརྞ། ས་ཏྱ་པྲ་ཏི་ཛྙཱ་ས་ར་དཱ། ཛྙཱ་ན་བ་ཏི། ཨུ་ཏ་པ་ད་ནི་བི་ནཱ་མ་ནི། ཨ་བྷི་ཥེ་ཙ་ནི། ཨ་བྷི་བྱཱ་ཧཱ་ར། ཤུ་བྷ་བ་ཏི། ཛཱི་མ་ཏུ། ཨེ་ཧི་ཀུ་མ་བཱ་ལན། བ་ཧ་ཧ་ར།
en: Nāga lord, how does the dhāraṇī called bestowing all happiness go?

source: ཀླེ་ཤཱ་ན་དྷུ་ན་པཱ་བ་མ། ཤོ་དྷ་ཡ་མཱརྒ་ན། ནི་རཱ་ཧི་ཀ་དྷརྨཱ་ཏཱ་ཤུད་དྷཱ། ལོ་ཀ་བི་ཏི་མི་ར་རཱ་ཛ་ས་དུ་ཁ། ཤ་མན་སརྦ་བུདྡྷ་ཨ་བ་ལོ་ཀ་ན་ཨ་དྷི་ཥྛི་ཏེ།
en: tadyathā || dhāraṇi dhāraṇi uddhāraṇi sampratiṣṭhite vijaya varna satyapratijñāsaradā jñānavati utpadani vināmani abhiśecani abhivyāhāra śubhavati jīmatu ehi kumabālan vaha hara kleśāna dhuna pāvama śodhaya mārgan nirāhikadharmātā śuddhāloka vitimirarājasa dukkha śamana sarva buddha avalokana adhiṣṭhite prajñā jñānabhe svāhā || “Nāga lord, the words of this dhāraṇī can accomplish all purposes.

source: པྲ་ཛྙཱ་ཛྙཱ་ན་བྷེ་སྭཱ་ཧཱ། ཀླུའི་བདག་པོ་གཟུངས་ཀྱི་ཚིག་དོན་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་པ་ཆོས་ཀྱི་སྐུ་ལ་འཇུག་པ།
en: They involve the Dharma body.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ།
en: They are blessed by all the buddhas.

source: བདེ་བ་ཐམས་ཅད་སྦྱིན་པ་འདི་དག་གཟུང་བར་བྱ།
en: They bestow all manner of happiness.

source: བརྗོད་པར་བྱའོ། །ཀླུའི་བདག་པོ་གཞན་ཡང་སྤྲིན་གྱི་རིགས་ལས་འབྱུང་བའི་བྱིན་གྱི་རླབས་བཀོད་པ་གཟི་བརྗིད་ཀྱི་སྙིང་པོ་སྤྲུལ་པ་སྣང་བར་བྱེད་པ།
en: You should uphold and proclaim them.
